nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.h
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
/*! @brief CAN FDmessage frame structure. */
typedef struct _flexcan_fd_frame
{
    struct
    {
        uint32_t bitsTimestamp : 16; /*!< FlexCAN internal Free-Running Counter Time Stamp. */
        uint32_t bitsLength : 4;     /*!< CAN frame payload length in bytes(Range: 0~8). */
        uint32_t bitType : 1;        /*!< CAN Frame Type(DATA or REMOTE). */
        uint32_t bitFormat : 1;      /*!< CAN Frame Identifier(STD or EXT format). */
        uint32_t bitSrr : 1;         /*!< Substitute Remote request. */
        uint32_t : 1;
        uint32_t bitsCode : 4; /*!< Message Buffer Code. */
        uint32_t : 1;
        uint32_t bitEsi : 1; /*!< Error State Indicator. */
        uint32_t bitBrs : 1; /*!< Bit Rate Switch. */
        uint32_t bitEdl : 1; /*!< Extended Data Length. */
    };
    struct
    {
        uint32_t bitsId : 29; /*!< CAN Frame Identifier, should be set using FLEXCAN_ID_EXT()
                            or FLEXCAN_ID_STD() macro. */
        uint32_t : 3;         /*!< Reserved. */
    };
    union
    {
        struct
        {
            uint32_t u32DataWord[16]; /*!< CAN FD Frame payload, 16 double word maximum. */
        };
        /* Note: the maximum databyte* below is actually 64, user can add them if needed,
           or just use dataWord[*] instead. */
        struct
        {
            uint8_t u8DataByte3; /*!< CAN Frame payload byte3. */
            uint8_t u8DataByte2; /*!< CAN Frame payload byte2. */
            uint8_t u8DataByte1; /*!< CAN Frame payload byte1. */
            uint8_t u8DataByte0; /*!< CAN Frame payload byte0. */
            uint8_t u8DataByte7; /*!< CAN Frame payload byte7. */
            uint8_t u8DataByte6; /*!< CAN Frame payload byte6. */
            uint8_t u8DataByte5; /*!< CAN Frame payload byte5. */
            uint8_t u8DataByte4; /*!< CAN Frame payload byte4. */
        };
    };
} flexcan_fd_frame_t;
#endif

/*! @brief FlexCAN protocol timing characteristic configuration structure. */
typedef struct _flexcan_timing_config
{
    uint16_t u16PreDivider; /*!< Clock Pre-scaler Division Factor. */
    uint8_t u8RJumpWidth;   /*!< Re-sync Jump Width. */
    uint8_t u8PhaseSeg1;    /*!< Phase Segment 1. */
    uint8_t u8PhaseSeg2;    /*!< Phase Segment 2. */
    uint8_t u8PropSeg;      /*!< Propagation Segment. */
} flexcan_timing_config_t;

/*!
 * @brief Configuration for the Flexcan CAN FD mode. It only cover FD related parts.
 *
 * It is used as member of @ref _flexcan_config to do the CAN FD specific init on init
 * this peripheral.
 */
typedef struct _flexcan_fd_config
{
    uint32_t u32BaudRateBps;               /* BaudRate after the Bit Rate Switch*/
    flexcan_timing_config_t sTimingConfig; /* Timing configuration for CAN FD transaction after BRS */
    flexcan_mb_size_t eMsgSize;            /* Size of the message buffer payload */
    bool bEnableTxDelayCompensation;       /* Enable/Disable transmit delay compensation */
    bool bEnableBitRateSwitch;             /* Enable/disable feature of bit rate switch */
} flexcan_fd_config_t;

/*! @brief FlexCAN module configuration structure. */
typedef struct _flexcan_config
{
    /* Clock and Timing Config */
    uint32_t u32BaudRateBps;               /*!< FlexCAN baud rate in bps. */
    uint32_t u32ClkFreqHz;                 /*!< Clock Frequency */
    flexcan_timing_config_t sTimingConfig; /* Protocol timing . */
    flexcan_clock_source_t eClkSrc;        /*!< Clock source for FlexCAN Protocol Engine. */

    /* Message Buffer Configuration */
    uint8_t u8MaxMsgBufNum;  /*!< The maximum number of Message Buffers used by user. */
    bool bEnableIndividMask; /*!< Enable or Disable Rx Individual Mask. */

    /* Wake Up Config */
    flexcan_wake_up_source_t eWakeupSrc; /*!< Wake up source selection. */
    bool bEnableSelfWakeup;              /*!< Enable or Disable Self Wakeup Mode. */
    bool bEnableLoopBack;                /*!< Enable or Disable Loop Back Self Test Mode. */
    bool bEnableTimerSync;               /*!< Enable or Disable Timer Synchronization. */
    bool bDisableSelfReception;          /*!< Enable or Disable Self Reflection. */
    bool bEnableListenOnlyMode;          /*!< Enable or Disable Listen Only Mode. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT)
    bool bEnableDoze; /*!< Enable or Disable Doze Mode. */
#endif

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
    /* Flexcan FD configuration */
    flexcan_fd_config_t *psFDConfig; /* Flexcan FD configuration*/
#endif
} flexcan_config_t;

/*!
 * @brief FlexCAN Receive Message Buffer configuration structure
 *
 * This structure is used as the parameter of FLEXCAN_SetRxMbConfig() function.
 * The FLEXCAN_SetRxMbConfig() function is used to configure FlexCAN Receive
 * Message Buffer. The function abort previous receiving process, clean the
 * Message Buffer and activate the Rx Message Buffer using given Message Buffer
 * setting.
 */
typedef struct _flexcan_rx_mb_config
{
    uint32_t u32Id;                 /*!< CAN Message Buffer Frame Identifier, should be set using
                                      FLEXCAN_ID_EXT() or FLEXCAN_ID_STD() macro. */
    flexcan_frame_format_t eFormat; /*!< CAN Frame Identifier format(Standard of Extend). */
    flexcan_frame_type_t eType;     /*!< CAN Frame Type(Data or Remote). */
} flexcan_rx_mb_config_t;

/*! @brief FlexCAN Rx FIFO configuration structure. */
typedef struct _flexcan_rx_fifo_config
{
    uint32_t *pu32IdFilterTable;                 /*!< Pointer to the FlexCAN Rx FIFO identifier filter table. */
    uint8_t u8IdFilterNum;                       /*!< The quantity of filter elements. */
    flexcan_rx_fifo_filter_type_t eIdFilterType; /*!< The FlexCAN Rx FIFO Filter type. */
    flexcan_rx_fifo_priority_t ePriority;        /*!< The FlexCAN Rx FIFO receive priority. */
} flexcan_rx_fifo_config_t;

/*! @brief FlexCAN Message Buffer transfer. */
typedef struct _flexcan_mb_transfer
{
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
    flexcan_fd_frame_t *psFrameFD;
#endif
    flexcan_frame_t *psFrame; /*!< The buffer of CAN Message to be transfer. */
    uint8_t u8MsgBufIdx;      /*!< The index of Message buffer used to transfer Message. */
} flexcan_mb_transfer_t;

