nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.h
/*! @brief FlexCAN Rx FIFO transfer. */
typedef struct _flexcan_fifo_transfer
{
    flexcan_frame_t *psFrame; /*!< The buffer of CAN Message to be received from Rx FIFO. */
} flexcan_fifo_transfer_t;

/*! @brief FlexCAN handle structure definition. */
typedef struct _flexcan_handle flexcan_handle_t;

/*! @brief FlexCAN transfer callback function.
 *
 *  The FlexCAN transfer callback returns a value from the underlying layer.
 *  If the status equals to kStatus_FLEXCAN_ErrorStatus, the result parameter is the Content of
 *  FlexCAN status register which can be used to get the working status(or error status) of FlexCAN module.
 *  If the status equals to other FlexCAN Message Buffer transfer status, the result is the index of
 *  Message Buffer that generate transfer event.
 *  If the status equals to other FlexCAN Message Buffer transfer status, the result is meaningless and should be
 *  Ignored.
 */
typedef void (*flexcan_transfer_callback_t)(flexcan_handle_t *psHandle,
                                            status_t status,
                                            uint32_t result,
                                            void *pUserData);

/*! @brief FlexCAN handle structure. */
struct _flexcan_handle
{
    CAN_Type *base;                         /* Base address of the CAN Peripheral */
    flexcan_transfer_callback_t pfCallback; /*!< Callback function. */
    void *pUserData;                        /*!< FlexCAN callback function parameter.*/
    flexcan_frame_t *volatile psMbFrameBufs[CAN_WORD1_COUNT];
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
    flexcan_fd_frame_t *volatile psFDMbFrameBufs[CAN_WORD1_COUNT];
#endif
    /*!< The buffer for received data from Message Buffers. */
    flexcan_frame_t *volatile psRxFifoFrameBuf;       /*!< The buffer for received data from Rx FIFO. */
    volatile uint8_t u8MsgBufStates[CAN_WORD1_COUNT]; /*!< Message Buffer transfer state. */
    volatile uint8_t u8RxFifoState;                   /*!< Rx FIFO transfer state. */
    volatile uint32_t u32TimeStamps[CAN_WORD1_COUNT]; /*!< Mailbox transfer timestamp. */
};

/******************************************************************************
 * API
 *****************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Unsorted @todo
 * @{
 */

/*!
 * @brief Get the FlexCAN instance from peripheral base address.
 *
 * @param base FlexCAN peripheral base address.
 * @return FlexCAN instance.
 */
uint32_t FLEXCAN_GetInstance(CAN_Type *base);

/* @} */

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Initializes a FlexCAN instance with classic / FD mode supported.
 *
 * This function initializes the FlexCAN module with user-defined settings.
 * User can call the FELXCAN_GetDefaultConfig function an starting point for
 * the needed init configuration structure.
 *
 * @note If user want to initialize the peripheral in CAN FD mode, user can
 * call the FLEXCAN_GetFDDefaultConfig to get the @ref _flexcan_fd_config_t
 * and assign the address of the data structure to the member psFDConfig of
 * @ref _flexcan_config_t
 *
 * @param base FlexCAN peripheral base address.
 * @param psConfig Pointer to the user-defined configuration structure.
 */
void FLEXCAN_Init(CAN_Type *base, const flexcan_config_t *psConfig);

/*!
 * @brief De-initializes a FlexCAN instance.
 *
 * This function disables the FlexCAN module clock and sets all register values
 * to the reset value.
 *
 * @param base FlexCAN peripheral base address.
 */
void FLEXCAN_Deinit(CAN_Type *base);

/*!
 * @brief Gets the default configuration structure.
 *
 * This function initializes the FlexCAN configuration structure to default values. The default
 * values are as follows. User is requested to provide the clock frequency for the peripheral.
 *
 * @note By default, CAN FD mode is disabled and not configured.
 *
 * @code
    psConfig->u32ClkFreqHz   = u32ClkFreqHz;
    psConfig->eClkSrc        = kFLEXCAN_ClkSrc0;
    psConfig->u32BaudRateBps = 1000000U;
    psConfig->u8MaxMsgBufNum        = 16;
    psConfig->bEnableLoopBack       = false;
    psConfig->bEnableTimerSync      = true;
    psConfig->bEnableSelfWakeup     = false;
    psConfig->eWakeupSrc            = kFLEXCAN_WakeupSrcUnfiltered;
    psConfig->bEnableIndividMask    = false;
    psConfig->bDisableSelfReception = false;
    psConfig->bEnableListenOnlyMode = false;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT)
    psConfig->bEnableDoze = false;
#endif
    psConfig->sTimingConfig.u8PhaseSeg1  = 3;
    psConfig->sTimingConfig.u8PhaseSeg2  = 2;
    psConfig->sTimingConfig.u8PropSeg    = 1;
    psConfig->sTimingConfig.u8RJumpWidth = 1;
    psConfig->psFDConfig = NULL;
   @endcode
 *
 * @param psConfig Pointer to the FlexCAN configuration structure.
 * @param u32ClkFreqHz Flexcan peripheral clock
 */
void FLEXCAN_GetDefaultConfig(flexcan_config_t *psConfig, uint32_t u32ClkFreqHz);

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
/*!
 * @brief Gets the default configuration structure for Flexcan FD mode.
 *
 * The function provided the default value of the data structure as code below
 *
 * @code
    psConfig->u32BaudRateBps = 2000000U;
    psConfig->sTimingConfig.u8PhaseSeg1 = 3;
    psConfig->sTimingConfig.u8PhaseSeg2 = 3;
    psConfig->sTimingConfig.u8PropSeg   = 1;
    psConfig->sTimingConfig.u8RJumpWidth = 1;
    psConfig->eMsgSize = kFLEXCAN_64BperMB;
    psConfig->bEnableTxDelayCompensation = true;
    psConfig->bEnableBitRateSwitch = true;
   @endcode
 *
 * @param psConfig          Pointer to the FlexCAN configuration structure.
 */
void FLEXCAN_GetFDDefaultConfig(flexcan_fd_config_t *psConfig);
#endif
/* @} */

/*!
 * @name Freeze Mode Operation
 * @{
 */

/*!
 * @brief Enter FlexCAN Freeze Mode.
 *
 * This function makes the FlexCAN work under Freeze Mode.
 *
 * @param base FlexCAN peripheral base address.
 */
void FLEXCAN_EnterFreezeMode(CAN_Type *base);

/*!
 * @brief Exit FlexCAN Freeze Mode.
 *
 * This function makes the FlexCAN leave Freeze Mode.
 *
 * @param base FlexCAN peripheral base address.
 */
void FLEXCAN_ExitFreezeMode(CAN_Type *base);
/* @} */

/*!
 * @name Timing Calculation Helper Functions
 * @{
 */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
/*!
 * @brief Calculates the improved timing values by specific baudrates for CANFD
 *
 * @param psTimingConfig Pointer to the FlexCAN timing configuration structure.
 * @param psFDTimingConfig Pointer to the FlexCAN FD timing configuration structure.
 * @param u32BaudRateBps  The CANFD bus control speed in bps defined by user
 * @param u32FDBaudRateBps  The CANFD bus data speed in bps defined by user
 * @param u32SrcClkHz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param psTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
bool FLEXCAN_FDCalculateImprovedTimingValues(flexcan_timing_config_t *psTimingConfig,
                                             flexcan_timing_config_t *psFDTimingConfig,
                                             uint32_t u32BaudRateBps,
                                             uint32_t u32FDBaudRateBps,
                                             uint32_t u32SrcClkHz);
#endif

/*!
 * @brief Calculates the improved timing values by specific baudrates for classical CAN
 *
 * @param psTimingConfig Pointer to the FlexCAN timing configuration structure.
 * @param u32BaudRateBps The classical CAN speed in bps defined by user
 * @param u32SrcClkHz The Source clock data speed in bps. Zero to disable baudrate switching
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
bool FLEXCAN_CalculateImprovedTimingValues(flexcan_timing_config_t *psTimingConfig,
                                           uint32_t u32BaudRateBps,
                                           uint32_t u32SrcClkHz);

/* @} */

/*!
 * @name Timing Configuration
 * @{
 */

